#   4.6: Combining & Exporting Data 

## Table of content:

### Task 1 - If you haven’t merged your prepared Instacart orders data with the new orders_products_prior dataframe per the instructions in this Exercise, do so now (all this task was also done in a separate notebook)


#### a) Download the new data set.
#### b) Unzip the file and move it into your project folder.
#### c) Import the data set into Jupyter as a new dataframe: df_ords_prior.
#### d) Check the dimensions of the imported dataframe.
#### e) Merge the dataframe with your df_ords dataframe.
#### f) Use the indicator argument to check whether there was a full match between the two dataframes.


### Task 2 - Export the merged file in pickle format as “orders_products_combined.pkl”.

### Task 3 - In a new notebook, import the orders_products_combined dataframe from the pickle file you just saved.

### Task 4 - Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

### Task 5 - Determine a suitable way to combine the orders_products_combined dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

### Task 6 - Confirm the results of the merge using the merge flag.

### Task 7 - Export the newly created dataframe as orders_products_merged in a suitable format (taking into consideration the size).

#### a)  Mixed Data Type

- Function for checking dataframe contains any mixed-type columns
- How to fix them

#### b) Missing Values

- Finding Missing Values
- View Missing Values
- Addressing Missing Values
- Replacing Missing Values
- Checking the number of rows in product dataframe
- Possible solution: Creating new dataframe without missing values in "product_name" 

#### c) Duplicates

- Finding Duplicates
- Addressing Duplicates
- Possible Solution: Creating a new dataframe that doesn’t include the duplicates

### Task 2 - Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

### Task 3 - Check for mixed-type data in your df_ords dataframe.

### Task 4 - If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

### Task 5 - Run a check for missing values in your df_ords dataframe.

- In a markdown cell, report your findings and propose an explanation for any missing values you find

### Task 6 - Address the missing values using an appropriate method.

- In a markdown cell, explain why you used your method of choice.

### Task 7 - Run a check for duplicate values in your df_ords data.

- In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

### Task 8 - Address the duplicates using an appropriate method.

- In a markdown cell, explain why you used your method of choice

### Task 9 - Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

#### Import Libraries

In [2]:
# Import libraries

import pandas as pd
import numpy as np
import os

## Task 1:

#### If you haven’t merged your prepared Instacart orders data with the new `orders_products_prior` dataframe per the instructions in this Exercise, do so now.

#### Import Data Sets

In [3]:
path = r'C:\Users\facun\Desktop\Data Analysis\CF\PYTHON\Instacart Basket Analysis'

### c) Import the data set into Jupyter as a new dataframe: df_ords_prior.

In [4]:
# orders_products_prior data ser

df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)

In [5]:
# orders data set

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

#### Check the output

In [6]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

### d) Check the dimensions of the imported dataframe

In [9]:
df_ords_prior.shape # 32434489 rows and 4 columns

(32434489, 4)

### e) Merge the dataframe with your df_ords dataframe

&

### f) Use the indicator argument to check whether there was a full match between the two dataframes

In [10]:
# Create new dataframe: combination of df_ords and df_ords_prior

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [11]:
# Checking output

df_merged_large.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [12]:
# Check output
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

## Task 2: 

#### Export the merged file in pickle format as “orders_products_combined.pkl”.

In [ ]:
# Export merged dataframe as pickle
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))

## Task 3:

#### In a new notebook, import the `orders_products_combined` dataframe from the pickle file you just saved.

In [19]:
df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [20]:
# Importing "products" data set

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

## Task 4:

#### Check the shape of the imported dataframe (it should be the same as the one you exported—always check!).

In [21]:
df_orders_products_combined.shape

(32434489, 12)

In [22]:
df_prods.shape

(49677, 6)

In [7]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
df_orders_products_combined.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

## Task 5:

#### Determine a suitable way to combine the `orders_products_combined` dataframe with your products data set. Make sure you’re using your wrangled, cleaned, and deduped products data set stored in your “Prepared Data” folder from the previous Exercise’s task.

In [23]:
# Drop unnamed columns in df_prods 
df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [10]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [24]:
# Drop unnamed columns in df_ords_prods_combined 
df_orders_products_combined = df_orders_products_combined.drop(columns = ['Unnamed: 0', '_merge', 'eval_set'])

In [25]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

#### Merge:

The df_order_products_combined.merge with df_prods using product_id as key

In [26]:
df_orders_products_merged = df_orders_products_combined.merge(df_prods, on = 'product_id', indicator = True)

## Task 6:

#### Confirm the results of the merge using the merge flag.

In [28]:
#Checking the values in the _merge column

df_orders_products_merged['_merge'].value_counts()

both          32406041
left_only            0
right_only           0
Name: _merge, dtype: int64

In [29]:
# Checking the merged shape

df_orders_products_merged.shape

(32406041, 14)

In [21]:
# checking df_orders_products_merged dataframe

df_orders_products_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

## Task 7:

Export the newly created dataframe as **orders_products_merged** in a suitable format (taking into consideration the size).

In [22]:
df_orders_products_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))